In [1]:
import numpy as np
import pandas as pd

<h2> Оглавление </h2>
<ul>  <li> <h3> Вычисления с помощью Numpy </h3>
     <ul>  <li> <a href = "#task001"> Задание1</a></li>
           <li> <a href = "#task002"> Задание2</a></li>
           <li> <a href = "#task003"> Задание3</a></li>
           <li> <a href = "#task004"> Задание4</a></li>
     </ul>
     </li>
     <li> <h3> Работа с данными в Pandas </h3>
     <ul> <li> <a href = "#task021"> Задание1</a></li>
          <li> <a href = "#task022"> Задание2</a></li>
          <li> <a href = "#task023"> Задание3</a></li>
          <li> <a href = "#task024"> Задание4</a></li>
          <li> <a href = "#task025"> Задание5</a></li>
           </ul>
     </li>
</ul>

<h3 id = "task001"> Задание1</h3>
<p> Импортируйте библиотеку Numpy и дайте ей псевдоним np.
Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов. Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем считать, что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее значение по каждому признаку, используя метод mean массива Numpy. Результат запишите в массив mean_a, в нем должно быть 2 элемента.</p>

In [2]:
arr1 = np.array([[1,2,3,3,1], [6,8,11,10,7]])
arr1.shape

(2, 5)

In [3]:
arr1 = arr1.T
arr1

array([[ 1,  6],
       [ 2,  8],
       [ 3, 11],
       [ 3, 10],
       [ 1,  7]])

In [4]:
mean_a = arr1.mean(axis =0)
print(mean_a)

[2.  8.4]

<h3 id = "task002"> Задание2 </h3>
<p> Вычислите массив a_centered, отняв от значений массива “а” средние значения соответствующих
признаков, содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие.
Получившийся массив должен иметь размер 5x2.</p>

In [5]:
a_centered = arr1 - mean_a
print('Форма a_centered', a_centered.shape)
print(a_centered)

Форма a_centered (5, 2)
[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

<h3 id = "task003"> Задание3 </h3>
<p> Найдите скалярное произведение столбцов массива a_centered. В результате должна получиться
величина a_centered_sp. Затем поделите a_centered_sp на N-1, где N - число наблюдений.</p>

In [6]:
a_centered_sp = np.dot(a_centered[:, 0], a_centered[:, 1])
print("a_centered_sp = ", a_centered_sp)
a_covv = a_centered_sp / (a_centered.shape[0]-1) # число наблюдений у нас в строках значит нулевой индекс  из массива shape
print("a_covv = ", a_covv)

a_centered_sp =  8.0
a_covv =  2.0

<h3 id = "task004"> Задание4 </h3>
<p> Число, которое мы получили в конце задания 3 является ковариацией двух признаков, содержащихся
в массиве “а”. В задании 4 мы делили сумму произведений центрированных признаков на N-1, а не на
N, поэтому полученная нами величина является несмещенной оценкой ковариации.</p>

In [7]:
#проверка
a_covv2 = np.cov(arr1.T, ddof=1) # ddоf - дельта степеней свободы для оценки несмещенной дисперсии (ковариации)
print(a_covv2[0,1] == a_covv) # Если True проверка пройдена

True

<h3 id = "task021"> Задание1 </h3>
<p> Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со
столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и
['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно
содержатся данные:
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и
поклонники'],
[450, 300, 350, 500, 450, 370, 290].<p>

In [8]:
authors = pd.DataFrame({'author_id': [1, 2, 3],
                        'author_name':['Тургенев','Чехов', 'Островский']})
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                     'book_title': ['Отцы и дети','Рудин','Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 
                                   'Таланты и поклонники'],
                     'price': [450, 300, 350, 500, 450, 370, 290]
                    })

# выводим созданные таблицы
print("autors DataFrame \n", authors)     
print("book DataFrame \n", book)

autors DataFrame
    author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский
book DataFrame
    author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

<h3 id ="task022"> Задание2</h3>
<p> Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id. </p>

In [9]:
authors_price = pd.merge(authors, book, on = 'author_id')
authors_price

,author_id,author_name,book_title,price
0,1,Тургенев,Отцы и дети,450
1,1,Тургенев,Рудин,300
2,1,Тургенев,Дворянское гнездо,350
3,2,Чехов,Толстый и тонкий,500
4,2,Чехов,Дама с собачкой,450
5,3,Островский,Гроза,370
6,3,Островский,Таланты и поклонники,290

<h3 id ="task023">Задание3</h3>
<p>Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими
книгами.</p>

In [10]:
top5 = authors_price.sort_values(by = 'price', ascending = False).iloc[:5, :]
top5

,author_id,author_name,book_title,price
3,2,Чехов,Толстый и тонкий,500
0,1,Тургенев,Отцы и дети,450
4,2,Чехов,Дама с собачкой,450
5,3,Островский,Гроза,370
2,1,Тургенев,Дворянское гнездо,350

<h3 id = "task024"> Задание4 </h3>
<p>Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat
должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя
цена на книги этого автора.</p>

In [11]:
authors_stat = pd.DataFrame()
authors_stat # создаем новый пустой датафрам

In [12]:
min_price = authors_price.groupby(by = 'author_name', as_index= True).min()
max_price = authors_price.groupby(by = 'author_name', as_index= True).max()
mean_price= authors_price.groupby(by = 'author_name', as_index= True).mean()
authors_stat['author_name'] = min_price.index
authors_stat.index = min_price.index
authors_stat['min_price'] = min_price.price
authors_stat['max_price'] = max_price.price
authors_stat['mean_price'] = mean_price.price
authors_stat

,author_name,min_price,max_price,mean_price
author_name,,,,
Островский,Островский,290,370,330.000000
Тургенев,Тургенев,300,450,366.666667
Чехов,Чехов,450,500,475.000000

<h3 id = "task025"> Задание5 </h3>
<p>Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться
данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные
из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].
Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого
автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого
функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами
должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при
необходимости загрузите библиотеку Numpy.
Назовите полученный датасет book_info и сохраните его в формат pickle под названием
"book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь,
что датафреймы book_info и book_info2 идентичны.</p>

In [13]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

,author_id,author_name,book_title,price,cover
0,1,Тургенев,Отцы и дети,450,твердая
1,1,Тургенев,Рудин,300,мягкая
2,1,Тургенев,Дворянское гнездо,350,мягкая
3,2,Чехов,Толстый и тонкий,500,твердая
4,2,Чехов,Дама с собачкой,450,твердая
5,3,Островский,Гроза,370,мягкая
6,3,Островский,Таланты и поклонники,290,мягкая

In [14]:
pd.pivot_table?

Signature:
pd.pivot_table(
    data,
    values=None,
    index=None,
    columns=None,
    aggfunc='mean',
    fill_value=None,
    margins=False,
    dropna=True,
    margins_name='All',
    observed=False,
) -> 'DataFrame'
Docstring:
Create a spreadsheet-style pivot table as a DataFrame.

The levels in the pivot table will be stored in MultiIndex objects
(hierarchical indexes) on the index and columns of the result DataFrame.

Parameters
----------
data : DataFrame
values : column to aggregate, optional
index : column, Grouper, array, or list of the previous
    If an array is passed, it must be the same length as the data. The
    list can contain any of the other types (except list).
    Keys to group by on the pivot table index.  If an array is passed,
    it is being used as the same manner as column values.
columns : column, Grouper, array, or list of the previous
    If an array is passed, it must be the same length as the data. The
    list can contain any of the other types (except list).
    Keys to group by on the pivot table column.  If an array is passed,
    it is being used as the same manner as column values.
aggfunc : function, list of functions, dict, default numpy.mean
    If list of functions passed, the resulting pivot table will have
    hierarchical columns whose top level are the function names
    (inferred from the function objects themselves)
    If dict is passed, the key is column to aggregate and value
    is function or list of functions.
fill_value : scalar, default None
    Value to replace missing values with (in the resulting pivot table,
    after aggregation).
margins : bool, default False
    Add all row / columns (e.g. for subtotal / grand totals).
dropna : bool, default True
    Do not include columns whose entries are all NaN.
margins_name : str, default 'All'
    Name of the row / column that will contain the totals
    when margins is True.
observed : bool, default False
    This only applies if any of the groupers are Categoricals.
    If True: only show observed values for categorical groupers.
    If False: show all values for categorical groupers.

    .. versionchanged:: 0.25.0

Returns
-------
DataFrame
    An Excel style pivot table.

See Also
--------
DataFrame.pivot : Pivot without aggregation that can handle
    non-numeric data.

Examples
--------
>>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
...                          "bar", "bar", "bar", "bar"],
...                    "B": ["one", "one", "one", "two", "two",
...                          "one", "one", "two", "two"],
...                    "C": ["small", "large", "large", "small",
...                          "small", "large", "small", "small",
...                          "large"],
...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
...                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
>>> df
     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

This first example aggregates values by taking the sum.

>>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
...                     columns=['C'], aggfunc=np.sum)
>>> table
C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

We can also fill missing values using the `fill_value` parameter.

>>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
...                     columns=['C'], aggfunc=np.sum, fill_value=0)
>>> table
C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

The next example aggregates by taking the mean across multiple columns.

>>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
...                     aggfunc={'D': np.mean,
...                              'E': np.mean})
>>> table
                D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

We can also calculate multiple types of aggregations for any given
value column.

>>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
...                     aggfunc={'D': np.mean,
...                              'E': [min, max, np.mean]})
>>> table
                D    E
            mean  max      mean  min
A   C
bar large  5.500000  9.0  7.500000  6.0
    small  5.500000  9.0  8.500000  8.0
foo large  2.000000  5.0  4.500000  4.0
    small  2.333333  6.0  4.333333  2.0
File:      /opt/anaconda3/envs/datalore-user/lib/python3.7/site-packages/pandas/core/reshape/pivot.py
Type:      function

In [19]:
book_info = pd.pivot_table(authors_price,
                          values ='price', columns = ['cover'], index = ['author_name'], aggfunc = np.sum)
book_info

cover,мягкая,твердая
author_name,,
Островский,660.0,NaN
Тургенев,650.0,450.0
Чехов,NaN,950.0

In [20]:
book_info = book_info.fillna(0)
book_info

cover,мягкая,твердая
author_name,,
Островский,660.0,0.0
Тургенев,650.0,450.0
Чехов,0.0,950.0

In [21]:
book_info.to_pickle('book_info.pkl')

In [22]:
book_info2 = pd.read_pickle('book_info.pkl')
book_info2

cover,мягкая,твердая
author_name,,
Островский,660.0,0.0
Тургенев,650.0,450.0
Чехов,0.0,950.0

In [23]:
book_info == book_info2 # дествительно идентичны

cover,мягкая,твердая
author_name,,
Островский,True,True
Тургенев,True,True
Чехов,True,True